app/controllers/admin_controller.rb

INSERT INTO `user_houses` (`created_at`, `updated_at`, `bu_code`, `user_id`) VALUES('2010-02-14 22:34:40', '2010-02-14 22:34:40', 201, 1)
---
  def create

    # Create a UserHouse Association with the passed params.
    @user_house = UserHouse.new
    user_id = params[:user_id]

    # needed user_id below, and @user_house.user_id was nil until the object gets saved I think
    # because a nil error was being given when I directly assigned params[:user_id] to the
    # @user_house.user_id and then used the variable's attr in the find below.
    @user_house.user_id = user_id

    #-------------------------------------------------------------------------------
    # The :full_info of the house is passed to allow for easier searching, so using
    # that information, the associated house is found, and its :bu_code is added.
    #-------------------------------------------------------------------------------
    @user_house.bu_code = House.find_by_full_info(params[:house][user_id][:full_info]).bu_code

    # Save the association to the DB
    @user_house.save

SELECT * FROM `users`
---
  def index
    @import = Import.new
    @user = User.new
    @users = User.all

SELECT * FROM `imports` WHERE (`imports`.`id` = 0)
---
  def show
    @import = Import.find(params[:id])

INSERT INTO `users` (`created_at`, `updated_at`, `username`, `role`, `password_salt`, `password_hash`, `email`) VALUES('2010-02-13 19:37:56', '2010-02-13 19:37:56', 'john.smith', 'House-Admin', 'bbf5bad4f8e2f59f7e001f7fd5b6417273927fa2', '88327bcac4551b027fb54ae0efcfbb486beae65d', 'john.smith@gmail.com')
---
	def add_user

	  # create their username from the first part of their email
	  login = params[:user][:email].split("@")[0]
	  params[:user][:username] = login

    # generate a random temporary password
    params[:user][:password] = Digest::SHA1.hexdigest("--#{Time.now.to_s}--#{login}--")[0,6]
	  params[:user][:password_confirmation] = params[:user][:password]

	  # create the user with the new credentials
	  @user = User.new(params[:user])

	  # try and save the user to the db
	  if @user.save

INSERT INTO "imports" ("created_at", "csv_file_name", "updated_at", "csv_content_type", "processed", "csv_updated_at", "csv_file_size") VALUES('2010-01-23 20:01:57', 'Internship.pages', '2010-01-23 20:01:57', 'application/octet-stream', NULL, '2010-01-23 20:01:57', 128061)
DELETE FROM "staffs" WHERE (agency_staff = 'f')
---
  def import_csv

    # upload and save the file
    @import = Import.new(params[:import])
    @import.save

    # read the csv file into a 2-d array
    lines = parse_csv_file(@import.csv.path)


    # Provides and easy way for us to access the column header position when adding people later.
    #
    # We start with an array of column headers:
    #
    #     lines[0] = ["person_id", "first_name", "last_name", etc. ]
    #
    # We transform this into Hash containing the column header as the key and column position
    # as the value. @row_positions will end up looking something like the example below:
    #
    #     @row_positions = {:person_id => 1, :last_name => 3, :first_name => 2, etc. }
    #
    @row_positions = Hash[ *lines[0].map { |v| [ v.to_sym, lines[0].index(v) ] }.flatten ]

    # we don't want to add the column headers as a person so remove them
    lines.shift

    # make sure we have people to import
    if lines.size > 0

      # delete all the staff that aren't agency staff
      Staff.delete_all(["agency_staff = ?", false])

DELETE FROM `imports` WHERE `id` = 2
---
      end

      # we don't need the file anymore so we can remove it
      @import.destroy

INSERT INTO `imports` (`csv_file_size`, `updated_at`, `processed`, `csv_file_name`, `csv_content_type`, `csv_updated_at`, `created_at`) VALUES(7153, '2010-02-09 23:51:30', 0, 'call_log_backup_02_02_2010.sql', 'application/octet-stream', '2010-02-09 23:51:30', '2010-02-09 23:51:30')
DELETE FROM `imports` WHERE `id` = 7
---
	def restore
	  # upload and save the file
    @import = Import.new(params[:import])
    @import.save

	  success = system "mysql -u root call_log_development < #{@import.csv.path}"

	  if success
	    flash[:notice] = "The restore was successful."
	    @import.destroy