app/controllers/house_staffs_controller.rb

  def show
    @house_staff = HouseStaff.find(params[:id])
---
SELECT * FROM `house_staffs` WHERE (`house_staffs`.`id` = 129)


    staff_id = (/\d+/.match(full_name)).to_s

    if staff_id == "" || !(Staff.find_by_staff_id(staff_id))
---
SELECT * FROM `staffs` WHERE (last_name like 'lang' AND first_name like 'add')


    # if a valid staff_id is identified, but they are already assigned to the house, show message
    # if !.empty? then that means the staff is already assigned to the house because the array will have at least one element
    elsif !HouseStaff.find(:all, :conditions => ["staff_id = ? AND bu_code = ?", staff_id, @house.bu_code]).empty?
---
SELECT * FROM `house_staffs` WHERE (staff_id = '527' AND bu_code = 201)

      @house_staff.position_name = params[:house_staff][:position_name]
      @house_staff.sort_order = sort_order
      @house_staff.position_type = params[:house_staff][:position_type]
      @house_staff.save
---
INSERT INTO `house_staffs` (`created_at`, `staff_id`, `position_name`, `updated_at`, `sort_order`, `bu_code`, `position_type`) VALUES('2010-02-19 21:06:51', 527, 'House Coordinator', '2010-02-19 21:06:51', 3, 201, NULL)

  def destroy
    @house_staff = HouseStaff.find(params[:id])
    @house_staff.destroy
---
SELECT * FROM `house_staffs` WHERE (`house_staffs`.`id` = 27)
DELETE FROM `house_staffs` WHERE `id` = 27