app/controllers/houses_controller.rb

  def create

    #-------------------------------------------------------------------------------
    # Concatenate the house name and bu_code to add to full_info column to
    # facilitate easier autocomplete and searching.
    #-------------------------------------------------------------------------------
    params[:house][:full_info] = params[:house][:name] + " (" + params[:house][:bu_code] + ")"
    @house = House.new(params[:house])

    #-------------------------------------------------------------------------------
    # Set the House's :bu_code which is the primary key and rails was not
    # automatically entering in the database.
    #-------------------------------------------------------------------------------
    @house.bu_code = params[:house][:bu_code]

    respond_to do |format|
      if @house.save
---
INSERT INTO "houses" ("name", "address", "city", "ratio", "keys", "schedule_info", "behavior_plans", "zip", "created_at", "medication_times", "overview", "updated_at", "relief_pay", "bu_code", "phone1", "phone2", "waivers", "fax", "trainings_needed", "state") VALUES('Gordon College', '255 Grapevine Road', 'Wenham', '1:15 Profs:Students', 'Given at beginning of the year', 'Find it online foo.', 'Don''t stay up too late.', '01984', '2010-01-26 21:08:19', 'Caffeine at midnight.', 'This is a liberal arts college.', '2010-01-26 21:08:19', '$8.00 for most', 200, '978.867.2300', '978.867.4444', 'None', '800.I.DUNNO!', 'How to read.', 'MA')