app/controllers/reports_controller.rb

SELECT * FROM `staffs`
---
  def index
    @houses = House.all.sort_by(&:name)
    @staff = Staff.all