app/controllers/sessions_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'bennne111@gmail.com' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `password_hash` = 'e85a3804d3dd3f06af04141908b6bed44e5ce77e', `updated_at` = '2010-02-05 03:04:31', `password_salt` = '9b62ead2ce4632f87ab0cdaeae15821de7b79971' WHERE `id` = 2
---
  def reset_password

    # find the user who's email matches the one specified
    @user = User.find_by_email(params[:email])

    if @user.nil?
      flash[:error] = "No account exists with this email address."

    # update the user with a new generated password
    elsif @user.update_attributes(:system_generated_pw => true,
                                  :password => Digest::SHA1.hexdigest("--#{Time.now.to_s}--#{@user.username}--")[0,6])