app/controllers/staffs_controller.rb

SELECT * FROM "staffs" WHERE (staffs.last_name LIKE '%Ro%') ORDER BY staffs.agency_staff DESC
SELECT * FROM `staffs` WHERE (((staffs.cell_number LIKE '%3%') AND (staffs.home_number LIKE '%2%')) AND (staffs.full_name LIKE '%en%')) LIMIT 0, 100
SELECT count(*) AS count_all FROM `staffs` WHERE (((staffs.cell_number LIKE '%3%') AND (staffs.home_number LIKE '%2%')) AND (staffs.full_name LIKE '%en%'))
---
  def index

    #TODO, LIST HOW MANY STAFF ARE IN THE LIST.  BOTH WHEN A SEARCH IS EXECUTED OR OTHERWISE

    # The options for number of results per page.
    @number_per_page_options = [["25", "0"], ["50", "1"], ["75", "2"], ["100", "3"]]
    @number_per_page = params[:number_per_page] || 0
    @selected_number = @number_per_page_options[@number_per_page.to_i][0]

    # Save search terms so the fields can be populated with them after a search instead of being cleared.
    @full_name = params[:staff][:full_name] unless params[:staff].nil?
    @home_number = params[:staff][:home_number] unless params[:staff].nil?
    @cell_number = params[:staff][:cell_number] unless params[:staff].nil?

    # to allow for searching with auto complete on last name
    params[:search][:full_name_like] = @full_name unless params[:staff].nil?
    params[:search][:home_number_like] = @home_number unless params[:staff].nil?
    params[:search][:cell_number_like] = @cell_number unless params[:staff].nil?

    @search = Staff.search(params[:search])
    @staffs = @search.paginate :per_page => @selected_number, :page => params[:page]

SELECT * FROM `staffs` WHERE (`staffs`.`id` = 438)
---
  def show
    @staff = Staff.find(params[:id])