app/controllers/users_controller.rb

  def reset_user_password

    # we need the user that's currently logged in
    @user = User.find_by_email(current_user.email)

    # update the password with the new one specified
    if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])
---
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'bennne111@gmail.com' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `password_hash` = 'e182a44c99e4134703579d004c72767956adf570', `updated_at` = '2010-02-05 03:08:31', `password_salt` = '5b0acd2ac1c533e9e942408b644b2d0110a9118f' WHERE `id` = 2

  def destroy
	  @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)